[
  {
    "name": "wsstampe",
    "place": "Calgary, Canada",
    "date": "November 1, 2017",
    "title": "Outstanding tour and tour guide!",
    "text": "With two days to explore St. Petersburg, one of our stops on a Viking Baltic Cruise, five of us decided to request a private guide from Tzar Tours (as recommended in Rick Steves' Northern European Cruise Ports guidebook). We communicated by email with Natalya German-Tsarkova and other staff members of Tzar Travel to plan our two-day schedule and they were very professional and accommodating in their responses to our requests. Our clearance upon arrival was quick and smooth and we were in the van and on our way before the scheduled time. Our itinerary included tours of every one of the well-known sights we had requested as well unexpected and much-appreciated visits to the Admiral’s subway station, a stop by the Neva River, and the opportunity to visit a unique grocery store on Nevsky Prospekt. The vehicle was very comfortable and the driver was skilful and careful. The sound systems both in the car and during our walks\/tours were so effective and made our guide's commentary accessible to all of us.\n\nWhat took our tour from being great to outstanding though was our the quality of our guide, Yuliya! Just a few of the positive characteristics that we all noticed were:\n\n- her excellent communication skills - Her mastery of the English language was remarkable and she was a very good listener, attending to our questions and needs thoughtfully and thoroughly; she brought a lovely openness and sense of humour to her very professional approach.\n\n- her energy, quiet confidence and positive approach to everything all day long - She never appeared flustered and smoothly made in-the-moment decisions and arrangements, guiding us so as to avoid crowds and maximize our time in each location.\n\n- her extensive knowledge across many fields – Skilfully weaving together facts about significant people, places, and events, Yuliya deepened our understanding of the history of Russia and St. Petersburg; at the same time, she helped us understand contemporary life in the city, from child care and education to real estate and infrastructure.\n\n- her thoughtful choice of two restaurants that were comfortable and charming - They were exactly what we were hoping for as an experience of local cuisine and we were pleased that she ate with us, translating the menu, offering recommendations and continuing our conversation about St. Petersburg.\n\n- her excellent organizational and time management skills - We never felt rushed but were able to experience so much over two days.\n\nWe were delighted with our experience in St. Petersburg and highly recommend Tzar Tours and our guide, Yuliya!"
  },
  {
    "name": "neatz",
    "date": "October 27, 2017",
    "title": "I picked a winner!!!",
    "text": "I am in the travel industry and consequently quite picky about customer service, promptness. quality of my experience, and overall value. I indeed picked a winner when I chose Tzar Travel with Natalya. All correspondence was timely and accurate, although we had hoped to have Natalya as our guide, she showed up at the pier to meet us in person and introduce our substitute guide because of a personal conflict. I was a bit miffed in the first 5 minutes...but, once our tour started with Marina, well ,( as I said to Natalya the following day when she checked in with us again to make sure all was going well) I don't know how to compare, but, Marina would be hard to beat..Natalya had taken good care of us. I highly recommend Natalya, with no hesitation. Thank you for everything!! We were with Tzar Travel for 2 days and saw more than most other companies said was possible, Natalya worked well with my list of places I wanted to see and arranged it in a way that we got everything in, even the 2.5-3 hours we wanted in the Hermitage. Super good job, by Natalya and Marina!"
  },
  {
    "name": "Dmichaelshoop",
    "place": "DLos Angeles, California",
    "date": "October 9, 2017",
    "title": "Private Guide in St. Petersburg",
    "text": "We had two days in St. Petersburg (via a cruise). Rather than using one of the cruise ship tours (which are too large and too impersonal), I used Natalya's company to coordinate a private tour in which our group of six were driven around in a private van and which were able to customize our itinerary. The first day was out at the two large palaces in the countryside. The second day was within St. Petersburg, including stops at known as well as less known sights (at my request). The tour guide was personable, spoke English well enough to get all of our jokes, was smart enough to laugh at all of our jokes, and had extensive knowledge of general history (for the city) but also art history (for individual paintings at The Hermitage). Normally, requesting personalized service would cost more; however, we paid less than what the cruise ship excursions would've cost. Therefore, it was win-win for our group--better prices and better service. I cannot recommend this tour group highly enough, including the pre-planning stages when I was able to communicate with Natalya via email to optimize our two-days."
  },
  {
    "name": "jellystonelover",
    "place": "Shoreline, Washington",
    "date": "September 30, 2017",
    "title": "Outstanding personalized tour with Maria and Konstantine (driver)",
    "text": "We had high expectations for our cruise-based two-day tour of St.Petersburg, having created a list of places to visit and sending it to ten different, highly recommended companies for their response. Tzar-Travel was the one who not only agreed to organize our tour, but was also enthusiastic about the varied itinerary we desired! That Natalya German-Tsarkova, the owner, came highly recommended by Rick Steves was also a plus, and her communication with us pre-tour was excellent and complete. We put together a tour group of six from our ship using the Roll Call feature on Cruise Critic.\nThe execution of the tour turned out to be flawless, with Maria (a public school English teacher) and Konstantine meeting us promptly at 9 at the cruise terminal. The first day we visited Our Lady of Kazan Cathedral, St. Nicholas Church, Peter and Paul Fortress and Cathedral, Museum of Russian Political History, and the Hermitage. With some 'extra' time during the day Maria worked in some places not on our original itinerary - the Grand Choral Synagogue and Faberge Museum. We had lunch at wonderful Stolle Pies, and dinner at Khochu Kharcho Georgian restaurant.\nOn the second day, we perused the bountiful Kuznechniy Farmers' Market and took the Metro to see some of the beautiful Stalin-era subway stations. We then drove to Peterhof and toured some of the Lower Fountain park, and enjoyed the fountains even on a rainy day! Lunch was at the Orangerie restaurant on the grounds. From there we stopped to tour the heart-breakingly beautiful Memorial to the Heroic Defenders of Leningrad on our way to tour the Church on Spilled Blood and St. Isaac's Cathedral. The finale for our tour was a walking tour in the steps of Dostoevsky's 'Crime and Punishment,' for which Maria had engaged an enthusiastic and knowledgeable Dostoevsky expert.\nWhile the tour came off logistically without a hitch, the shining star was Maria, whose knowledge of artistic, cultural, and political details was encyclopedic! Her warm and witty willingness to share tidbits about her life in this vibrant city made it feel like we were touring with a friend. Konstantine's driving allowed us to hop our of our mini-van at one entrance to an attraction and slip out on the other side and back into the van. I can't recommend Tzar-Travel and Maria highly enough!"
  },
  {
    "name": "Boohawk",
    "place": "Seattle, Washington",
    "date": "September 19, 2017",
    "title": "Wonderful Personalized Tour",
    "text": "We had an amazing two day tour with Anastasia (and Anton our driver) from Tzar Travel. We were traveling with my 80 year old parents. Dad has a walker. We were on a cruise and wanted to have a tour that could go at dad's pace so we wanted to set up a personal tour for just the four of us. I just told them what we wanted to see and let them schedule it out for us.\nAnastasia met us at the cruise ship and it was the start of a lovely day. She took us to the Church of the Resurrection and she gave us so much information about the church and its interior. She helped us select food at lunch so we had some typical Russian food experiences. Then in the afternoon we had one of the most remarkable experiences at the Hermitage. Anastasia was a Fine Arts major and essentially gave us a personal art lesson using the Hermitage paintings. It was such a a memorable experience. It is hard to describe how marvelous this was.\nThen on day two we went out to Catherine's Palace and again were given a wealth of information about Russia and Catherine and the palace itself. Afterwards when we were walking in the park she took us to a building on the lake where a quartet of men were singing Russian folk songs. The beautiful voices in a building with incredible acoustics was so lovely. Our family is musical - so this unexpected surprise was just one more experience that Anastasia made sure we had. She so wanted us to enjoy her country and city. She is passionate and it came across in everything she did.\nAnastasia went out of her way to provide us with the best two days we could have experienced in St. Petersburg. It was a bit scary to deal with someone in Russia via email but don't be nervous and book with Tzar Travel. You will not regret it."
  },
  {
    "name": "Mifis",
    "place": "Monterey, CA",
    "date": "September 10, 2017",
    "title": "Memorable custom tour with Nicole & Constantine of Tzar Travel!",
    "text": "My husband, two lifelong friends and myself booked a two day tour of St. Petersburg with Tzar Travel based on recommendations from the Rick Steves' guidebook. These two days were the highlight of our vacation. We exchanged emails with Natalya to create a customized tour that exactly fit our interests. We were met at the cruise terminal by Nicole, our tour guide, and Constantine, the driver or our very comfortable minivan. Nicole was delightful and her knowledge about the city, history and art was extensive and shared with great enthusiasm. We felt like we were on a VIP tour led by a friend who was flexible and predisposed to make sure we had a great time. Tzar Travel took care of all the necessary paperwork and Nicole made sure we had the necessary tickets for the various museums we visited. Getting into the Hermitage early and having Nicole lead us through the museum in such a way that we avoided all the other early tours meant that we had the rare privilege of seeing most of the rooms and art all by ourselves. And when we needed to move from place to place, there was Constantine with the van ready to go. We highly recommend Tzar Travel for a customized tour of St. Petersburg and consider yourselves lucky if you have Nicole and Constantine as your guides."
  },
  {
    "name": "John F",
    "place": "Birmingham, Alabama",
    "date": "August 11, 2017 via mobile",
    "title": "Fantastic tour!!",
    "text": "One of my friends had used this company and highly recommended it. Everything was set up by email. It was all done very professionally. We were met at the cruise terminal by Anna and our driver. We had a lovely 2 day tour of the highlights of St. Petersburg. We were driven around in a very nice Toyota Camry with bottled water provided. We felt very safe. We were able to get into the busy attractions quickly. Anna our guide was very pleasant and knowledgeable. Our driver did a wonderful job although I cannot remember his name.They were very conscientious about making sure we got back to the cruise terminal on time. All the documents were perfect to get into the country. I would highly recommend this company for a tour of the St. Petersburg area!!"
  },
  {
    "name": "Julie K",
    "place": "Cheltenham, United Kingdom",
    "date": "July 23, 2017 via mobile",
    "title": "Wonderful trip",
    "text": "My husband and I have just returned from a 4 day trip to St Petersburg. We contacted Natalya from Tsar Travel and she planned our days for us from airport transfers to all the tickets etc . We had a wonderful guide Anna who was so knowledgable and fun to be with .We saw so much and really loved St Petersburg . We would highly recommend Natalya and Tsar Travel to anyone planning a visit ."
  },
  {
    "name": "Stephen W",
    "place": "Pleasanton, California",
    "date": "July 16, 2017 via mobile",
    "title": "Great private tour of St Petersburg",
    "text": "My wife and I recently visit St Petersburg on a Baltic Sea cruise. I have Parkinson's, which limits my mobility. I'd exchanged e- mails with Natalya prior to our arrival, and planned a two day tour of the area with them, which would accommodate my mobility limitations.\nTzar Travel provided a minivan for transport, a steady and safe driver (Uri) and an excellent tour guide (Maria). We visited all the local sights, as well as Pushkin and other close tourist 'must see' areas.\nBoth Maria and Uri were great to work with. They provided, without doubt, the best tour excursion of our whole trip.\nBased upon our experience, I would recommend Tzar Travel without hesitation, especially for anyone with mobility issues."
  },
  {
    "name": "RJBruins",
    "place": "Rolling Hills Estates",
    "date": "July 14, 2017",
    "title": "A great way to see do-not-miss highlights of St. Petersburg",
    "text": "We booked this tour based on recommendations from Rick Steves' guidebook. I inquired about the tour, and Natalya responded promptly. Anne was our guide, and she is a linguist, spoke excellent English, and was very knowledgeable. We originally booked half day tours to Peterhof and Catherine's palace separately but changed it to one full day tour with stops at a metro station, and to a memorial commemorating the 900 day Leningrad siege. The full day tour is actually a very efficient way to see these out-of-the city sites, and allowed full days to see the other main sites. I highly recommend this tour if your are interested in a personalized experience in St. Petersburg."
  },
  {
    "name": "judgereferee",
    "place": "D.C.",
    "date": "July 14, 2017",
    "title": "Best way to visit St Petersburg",
    "text": "This was a three day private tour guided by owner Natalya German-Tsarkova. The tour was very well organized and dedicated to our taste and rate of progress. Natalya is both personable and professional. She has an excellent background in art history and made the city an it's environs come alive. She also made suggestions for us in our \"free\" time. Her English is excellent and she provided audio support when necessary. Both my sister and I highly recommend her."
  },
  {
    "name": "JustMarks",
    "place": "Redmond, Washington",
    "date": "June 10, 2017",
    "title": "Perfect visit to St. Petersberg for my family!",
    "text": "I first learned about Natalya from the Rick Steve's guidebook. I came to St. Petersburg for a single day on a Baltic cruise and found the official cruise excursions to be expensive and limited. After my first email back from Natalya, I was already hooked! I had explained I had 2 small children (5 & 8) and needed the tour to be fast paced since we only had one day. Her initial itinerary was spot on and her inclusive pricing was reasonable and let me know what to expect up front. She kept me updated as the cruise neared and Maria was waiting right outside the terminal doors like promised. We were with Maria from 9AM until 7PM and what a whirlwind we had! Car seats were provided along with some treats for the car ride. We saw all the major sites we had hoped to see (Perterhof, Hermitage, St. Peter's fortress and cathedral) and the kids were kept busy and engaged. Maria was a wealth of knowledge and made the trip personal and fun. She was patient with the kids and answered all their questions while keeping the pace brisk so they were never bored, a big concern when visiting the Hermitage! We went at our own pace and didn't feel like we needed to keep to the schedule. My wife's really into history and Maria was easily able to answer he questions and give her the backstories she was looking for. One of the highlights for the kids was getting to paint their own Matriyoshka dolls, something special Natalya had planned. Overall a FANTASTIC way to visit St. Petersburg for the first time and I would definitely recommend Natalya and use them again!"
  },
  {
    "name": "DonJonovan",
    "place": "Seattle, Washington",
    "date": "May 13, 2017 via mobile",
    "title": "WOW! Natalya is SUPERB! HIGHLY recommended!",
    "text": "We had 3 days in St. Petersburg, Natalya was our guide for all 3 days. Her suggestions were wonderful. We had full days and saw a lot of the City as well as Catherine's Palace and Peterhof.\nNatalya speaks excellent English and is treasure when visiting the Hermitage since she was an art major. She coordinated our airport pick up as well as transfers to\/from the Train station when we had a side trip to Moscow. She will do everything possible to help you enjoy your trip. She goes the 'extra mile' for you."
  },
  {
    "name": "Lorrie J",
    "place": "Morgan",
    "date": "April 14, 2017",
    "title": "St. Petersburg Russia",
    "text": "We loved Natalya and our tour. She was very knowledgeable and spoke English verty well. Would highly recommend using her as a guide. She gave us great recommendations on food as well as other places to visit."
  },
  {
    "name": "RichardSaller",
    "place": "Paris, France",
    "date": "March 14, 2017",
    "title": "Personal tour guide",
    "text": "Going on the two day personal guided tour with Tsar Travel and Natalia was the best thing we could have done. Worth every penny !! Thank you Natalia for you excellent work"
  },
  {
    "name": "Linda B",
    "place": "Oceanside, California",
    "date": "December 31, 2016",
    "title": "Fantastic experience",
    "text": "My boyfriend and I had only a few days to see St. Petersburg so to maximize our time we hired Natalya for two full days. We had a private guide and driver. Both of whom were outstanding. From the beginning to the end Natalya was very professional, flexible and informative. She was always prompt to respond in all formats of communication as well. While Natalya was not able to conduct the tour herself, she did make the time to meet us one day and brought us a thoughtful gift of a St. Petersburg guide book and chocolate bars. I was so surprised and impressed with her personal touch. The book sits on my coffee table today and has been great to reflect and learn more about what we saw.\n\nOur guide, Tatiana, was timely, friendly, thorough and knowledgeable in her explanations. With there being SO much to see in St. Petersburg, in the Hermitage alone, we were so glad to have their assistance. We got to see and understand so much more in the quick two days.\n\nIn addition, Natalya was able to help us secure tickets to see the ballet one evening at the Hermitage. What a memorable evening.\n\nSt. Petersburg is a fantastic place to see and we would highly recommend Natalya to assist anyone in making their visit the best possible."
  },
  {
    "name": "Brian B",
    "date": "October 17, 2016",
    "title": "St. Petersburg, experience a bit of Russia",
    "text": "I contacted Natalya about a guided tour of St. Petersburg several months before our departure. I had done my research, so I had a pretty good idea of what we wanted to see and do. Natalya made suggestions about what to include. We also wanted to see a ballet while we were there and after having difficulty charging the tickets directly with the theatre Natalya secured them for us. The day we arrived, she contacted us to make sure all was well and how the next day would play out. If anything about our itinerary had changed she called in advance to let us know.\nThe two guides, Julia and Anastasia, were excellent, each in their own way. They were both extremely knowledgeable, friendly and articulate.\nWe used two drivers on two separate days. We always felt safe in their very well maintained cars.\nI would highly recommend Natalya and her crew.\nWe were a little concerned about going to St. Petersburg on our own, but it is just like any other European city only the signs are in Cyrillic. The menus included an English translation, food delicious, service staff friendly. We took the hydrofoil to Peterhof on our own and managed the entire day very well. So I would recommend doing a few days with a private guide then strike out on your own. There are several apps you can use on your phone to get you anywhere you want to visit.\n"
  },
  {
    "name": "swissami19",
    "place": "Zug, Switzerland",
    "date": "October 15, 2016 via mobile",
    "title": "Peterhof/Catherine Palace",
    "text": "We had several offers for this day tour to these two fantastic palaces. Tzar Travel offered the most competitive price.\nNatalya's communication before the trip was good. She also called our hotel before\/after the tour to give us info & follow up.\nThe tour itself was very good. Anastasia provided us with alot of info at the palaces and during the drive. We appreciated the microphone\/speaker in the car. She managed the time well and we were able to even visit a few underground subway stations on the way back.\nConstantine was a great driver!\nI didn't give this 5 stars because the tour plan which was given to us was not communicated to Anastasia. In the end, we had a great time and Natalya did apologize for this small misunderstanding. \nWould definitely recommend this company."
  },
  {
    "name": "Marguerite T",
    "place": "Ottawa, Canada",
    "date": "September 17, 2016 via mobile",
    "title": "Couple traveling with elderly parents",
    "text": "It took me a long time to decide which company I was going to entrust with my limited 2 days visit to St Petersburg. Hiring a guide was new to me and I was really really nervous about biting the bullet and giving it a try. The 4 of us where trilled with our experience. It was awesome. We avoided the line ups. Visited at our speed. Went to see what we wanted to see.\nOlga our guide was pleasant and knowledgeable. Our driver was great.\n\nIt may seem like a lot of money at first but when i compared with the cost of booking the 2 day tour with the cruise ship vs the private tour what I found was for a family of 4 it the cost of the tours where exactly the same.\n\nI would define my recommend booking with Tzar travel."
  },
  {
    "name": "Esta S",
    "date": "September 13, 2016 via mobile",
    "title": "Tsar Travel is Fantastic",
    "text": "My husband and I booked a private 2 day St Petersburg tour with Natalya Germain. It was the highlight of our monthlong vacation touring the Baltics, Greenland and Iceland. Natalya was open to our requests to include specific attractions of interest to us. She promptly responded to our emails.\n\nShe assigned Anastasia to be our guide. Within a few minutes of meeting Anastasia and the driver Demitri we felt as if we were with friends. The two days were well organized and allowed for additional stops we had not anticipated. With a small tour we were able to bypass long lines and move through even the most crowded sights quickly without losing the ability to enjoy the remarkable historic sights and museums.\n\nAnastasia was knowledgeable and enthusiastic. In our opinion, this is the BEST WAY to tour St. Petersburg.\n\nAlso many thanks to Natalya for the welcome gifts."
  },
  {
    "name": "Ann G",
    "place": "Huntington Beach, California",
    "date": "August 1, 2016",
    "title": "Tour of St. Petersburgh",
    "text": "Tzar travel is very organized, responsive and we couldnt have been happier. Our guide was Tatayana but I am sure all the guides are wonderful. Planned a perfect two days and worked around having 2 children (10 and 12yrs) to spend the right amount of time at the sites."
  },
  {
    "name": "billmiriam",
    "place": "6 people for 2 days",
    "title": "Mercer Island, Washington",
    "date": "June 28, 2016",
    "text": "So much better than being on a bus full of 40 people trying to stay together. They went out of their way to take care of us and we were out well past any scheduled time. Plus, the guides were so knowledgeable. We moved so much quicker in a small group, and in a small van were able to get through the crowded streets so much quicker. Could not have been any better! One of the best decisions we made on our cruise was hiring Natalya while in St. Petersburg."
  },
  {
    "name": "Keith50_79",
    "place": "Seattle, Washington",
    "date": "June 27, 2016",
    "title": "Tzar-Travel Exceeded our Expectations !",
    "text": "We were on a Baltic cruise and had two days to see St Petersburg - not an easy thing to do because there is so much to see. And without the help of Tzar-Travel we would not have see half of what we did. Our guides Senya and Julia were great as was our driver Constantine. It is Constantine that made possible seeing all of the sites that we did - St Petersburg traffic is terrible !, but he found ways to get us thru it. Both of the guides were extremely accommodating and knowledgeable and fun to be with. Having a small group of just 6 of us made for flexibility of schedule - we did our canal cruise on a smaller boat mid-day when the sun was shining rather than waiting until the evening as originally planned. When we ran short of time Natalya got us into The Hermitage by the backdoor rather than waiting in what we were told were 2 hour long lines. Great experience that we highly recommend !"
  },
  {
    "name": "sandyr1234",
    "place": "Buffalo Grove, Illinois",
    "date": "June 25, 2016",
    "title": "St. Petersburg, Russia",
    "text": "We had two amazing days in St. Petersburg with our wonderful, intelligent and very knowledgeable guide, Anastasia and driver, Constantine. You could see how proud they were about their country with every venue we attended. We even got to go on the subway which was incredible! We were so pleased with our choice of Tzar Travel and highly recommend them to anyone traveling to Russia. Working with Natalya was wonderful. She was extremely responsive and informative every step of the way."
  },
  {
    "name": "Summerprincess1",
    "place": "Springville, Utah",
    "date": "May 19, 2016",
    "title": "Highest Recommendations!! Very Best of All!!",
    "text": "Natalya, owner of Tzar-Travel, and our tour guide, Julia, exceeded our very high expectations and made our trip to St. Petersburg absolutely outstanding in every way. Our group of four adults visited St. Petersburg May 7 & 8, 2016 as part of a cruise. Julia gave us an excellent sightseeing tour and combined it with her extensive knowledge of Russian history. We are able to see, learn, and expereince much more than we would have with the cruise excursions. Our driver, who was very kind and a very safe driver, took us right to the door and picked us up as quickly as we finished in each place. We didn't have to wait in any of the lines and saw everything we hoped to see. We attended the ballet in the evening and our driver was waiting outside for us and drove us right to our ship. Natalya is a great pleasure to work with and she is very happy to plan your tour so that you get to see what you would like to see. She did the perfect job of filling every moment possible of our stay with showing us St. Petersburg, Catherine Palace, and Peterhof. We approached this visit with great excitement and anticipation and I am so glad we booked with Tzar Travel. It turned out perfectly!! I recommend her tours with the greatest confidence!"
  },
  {
    "name": "ECAvoyager",
    "date": "October 21, 2015",
    "title": "5 days in St Petersburg",
    "text": "Excellent and friendly tour guides and driver!\nWe used Tzar travel for 5 days in June 2015. Natalya personally could not lead our tour but was able to set us up with tour guides during that time. All were excellent. One of them- Nora, was outstanding. She was SO friendly with our children! They still talk about her.\nAlso special thanks to Konstantin who was the driver for those 5 days. He was very professional and friendly. I enjoyed getting to know him during that time."
  },
  {
    "name": "Mariafern",
    "date": "October 15, 2015",
    "title": "Great trip!!",
    "text": "Thank you Natalya for organizing our beautiful trip to Moscow and St.Petersburg. Everything was perfect, from the moment we arrived in Moscow we started to experience your amazing guides and itineraries. Thanks to Svetlana in Moscow and Maria in St. Petersburg, not only showing us the beauty of the cities but also helping us in everything we need. Thanks to our driver in St.Petersburg who besides taking us everywhere in the city, shared stories of the Russian daily life, that enriched our trip to the max."
  },
  {
    "name": "kmp594",
    "place": "Santa Rosa, California",
    "date": "September 25, 2015",
    "title": "2 days in Russia",
    "text": "A wonderful experience . Our tour guide and driver were friendly and so efficient. Our driver made sure we were always safe getting in and out of the van. Our tour guide was so informative on all the aspects of Russia, I loved the idea having ear phones in the museums so we could hear Maria clearly. A memorable trip. One I would like to have more time to spend in Russia."
  },
  {
    "name": "Galina I",
    "place": "Sofia, Bulgaria",
    "date": "September 17, 2015",
    "title": "Unforgetable experience",
    "text": "We had only 2 days to spend in St Petersburg and spent one of them visiting both Peterhof and Pushkin with Tzar Travel. Our guide Julia was wonderful - very professional, funny and informative.\nWe discovered some very interesting sides of St Petersburg and the palaces thanks to Julia and Tzar Travel. If we come back, we will not hesitate to use them again."
  },
  {
    "name": "james h",
    "place": "New York City, New York",
    "date": "June 28, 2015",
    "title": "Private Tour",
    "text": "Natalya and her Team, did an excellent job of arranging a private tour for me and my wife. They were well informed, conscientious and a pleasure to spend time with. Would highly recommend them for anyone looking for notch better then the average fare.\nWould most definitely reserve with them again."
  },
  {
    "name": "PoppyParr",
    "place": "New York, New York, United States",
    "date": "June 28, 2015",
    "title": "Excellent Private Tour Guide",
    "text": "My husband and I used Tzar Travel - Natalya German for our private tour when we visited St Petersburg. Our guide Maria was great! Natalya and Maria worked with us to figure out a schedule that made sense for us for the 5 days we were there. It was as comprehensive as we wanted it to be. I would definitely recommend them to anyone!"
  },
  {
    "name": "akolt",
    "place": "San Francisco, California",
    "date": "June 26, 2015",
    "title": "Excellent tour",
    "text": "We were in St Pete for two days off the cruise ship and we made an arrangement with Natalya via email few month in advance. As we had a very limited time in port we worked with Natalya to customize the time to the interests of 8 people in the group. Natalya made great recommendations and we settled on three tours:\n1. Day 1 - daytime - Petergof and Tsarskoe selo tour with lunch in Podvorie restaurant\n2. Day 1 - nighttime - private boat - 3 hour canal boat tour with bridge opening viewing\n3. Day 2 - City tour with visits to Peter & Paul fortress, Chruch of Spill Blood and a Russian Museum.\nWe enjoyed our time enormously. Our guides Yulia ( daytime both days ) and Masha ( nighttime canal tour ) were both very knowledgeable and told us many interesting facts about Russian History and St Petersburg. And even though some of the sites we wanted to visit were not on our itinerary due to time constraints, Yulia was very flexible in accommodating us and making detours so we can see these sights such as Smolnij monastery.\nThe price for such a private tour for 8 people was very competitive with the other larger group tours. I highly recommend Ntalya and her agency."
  },
  {
    "name": "David F",
    "place": "Stow",
    "date": "June 22, 2015",
    "title": "St Petersburg Tour",
    "text": "Excellent 3-day tour--about 8-9 hours each day. Day 1--city tour of all important sites. Day 2--Alexander's Palace and grounds and exterior at Pavlovsk and St. Catherine's Palace. Day 3--Peterhof and hermitage. Guides were very knowledgable of all sites. Would higlky recommend Tzar Travel."
  },
  {
    "name": "serinlok",
    "place": "Geneva, Switzerland",
    "date": "June 3, 2015",
    "title": "saint petersburg love and culture escape",
    "text": "Best guide best organization: Peterhof, tserkoie selo, marinski, boat, hermitage, restaurant... driver, car... and weather were perfect best escape since longue time with my husband many thx for your help"
  },
  {
    "name": "jeanne t",
    "place": "Covington, Kentucky",
    "date": "June 3, 2015",
    "title": "from russia with love",
    "text": "I contacted Natalya from an ad in ITN. There were 7 of us from a cruise. She conducted 2 days tour. She was professional, knowledgeable and very good. I feel I have a good friend now in Russia."
  },
  {
    "name": "walton2253",
    "place": "Melbourne, Australia",
    "date": "October 27, 2014",
    "title": "Unforgettable",
    "text": "The only way to see and fully appreciate St Petersburg. Natalya was an excellent guide, very knowledgeable, efficient, and accommodating, we learnt so much from her and came away with a better appreciation of her country and its history. So much to see but we were guided with such expertise and care that it seemed easy. We had a private tour, we told Natalya what we wanted to do and see and she covered everything and more. We ended our three days , informed, wiser and feeling that we had gained a friend. Would thoroughly recommend this way of seeing this beautiful city."
  },
  {
    "name": "Casoakes",
    "place": "Virginia",
    "date": "August 25, 2014",
    "title": "Outstanding tour experience!",
    "text": "I must admit, I was a bit overwhelmed by the logistical requirements as an American attempting to obtain a visa to travel in Russia. All of my concerns and anxiety were out to rest once I found Natalya at original tours.\nOur custom private family tour was quickly scheduled and smoothly executed! Visas were emailed well in advance and instructions were clear. Our fantastic tour guide Anastasia and Costa were patiently waiting with a sign that clearly had our name! We were whisked away and had a fantastic full day tour to include an amazing tour of the Hermitage. We also stopped by a quaint local pierogi cafe and had a fantastic lunch. Highly recommend. Many thanks to Anastasia and Costa for a wonderful experience."
  },
  {
    "name": "3245elan",
    "place": "Haifa, Israel",
    "date": "August 21, 2014",
    "title": "3 perfect days with Natalya",
    "text": "Our stay in St. Petersburg was made even more special by Natalya. Touring the city with her was a very pleasant experience. Each day she filled with history, facts, many stories, personal information which brought it all alive for us. At every site, i.e. the Hermitage, Winter Palace, Summer Palace, etc. Natalya guided us past long queues, noisy guides, with elegance and patience and showed us many exhibits. She is very knowledgeable in history, art, religion and with much enthusiasm points out all the details whilst emphasizing her favourite items. We came away feeling enriched and much wiser!\nShe drove us to and from the airport and to evenings out driving expertly and always with a smile and eager to hear our views and experiences.\nWe felt that we were accompanying a close friend and not a stranger.\nWe highly recommend Natalya, a true professional in more ways than one."
  },
  {
    "name": "Savipam",
    "place": "New York City, New York",
    "date": "July 9, 2014",
    "title": "Amazing St. Petersburg Tours",
    "text": "Natalya and Anastasia, who guides for\/with her, made our visit to St. Petersburg extraordinary.\nNatalya created an itinerary incorporating our wish list and enhanced it with her suggestions and additions. Our three days in this beautiful city could not have been better. They were packed with amazing sights as well as wonderful lunches and dinners in excellent restaurants. She even took us to an icon writer's studio.\nAnastasia shepherded us through the crowded Peterhof, Hermitage, Church of the Spilled Blood with such skill that we almost felt we were the only people there. Her extensive knowledge of artworks enhanced our tours immeasurably.\nI highly recommend Original Tours, Natalya and Anastasia."
  },
  {
    "name": "Elitta",
    "place": "Danville, California",
    "date": "June 10, 2014",
    "title": "Amazing Tour and Guide",
    "text": "The tour was great, our guide was wonderful; she was very knowledgeable, thorough, bright, personable and professional. We learned a lot about the history, visited museums, sites and places of interest in St. Petersburg and neighboring areas. She gave us excellent recommendations of restaurants and authentic dishes, all fabulous; and without hesitation took us to places we had personal interest without even being on her schedule. I would highly recommend Natalya; here is the link to amazing tours: http://www.tripadvisor.com/Attraction_Review-g298507-d1948468-Reviews-Original_Tours_Natalya_German_Tsarkova-St_Petersburg_Northwestern_District.html"
  },
  {
    "name": "uroman",
    "place": "Menlo Park, CA",
    "date": "June 9, 2014",
    "title": "Three day experience in St Petersburg",
    "text": "My wife and I had a great time with Natalya on our three day tour in St Petersburg. She had each day planned out and we visited many churches and museums in St Petersburg with her excellent knowledge about each place we visited. The best part was checking out unusual places that only she knew about which included a visit to a matter icon painter and even a ride on the Metro.\nOne of the best parts of the visit was visiting the Mariinsky Palace where her step father is an assistant to the government leader of the city. We saw a Russian Orthodox service with choir performance in a newly restored church in the palace which was a real treat. Her personal knowledge of where to go and what to see made it a great experience. We also learned about her life and family in Russia and this also created a personal experience for us. I highly recommend Natalya for anyone touring St Petersburg."
  },
  {
    "name": "steve p",
    "place": "Gainesville, Florida",
    "date": "June 4, 2014",
    "title": "St Petersburg, Russia tour guide",
    "text": "My wife and I toured the Baltic for 17 days and the highligt of our vacation was the two days that we spent in St Petersburg. Natayla German-Tsarkova was our guide and by far this was the best guide during our time abroad. She is an art history major and extremely knowledgeable about the museums, works of art, historic buildings, and the history of the city. If you plan on visiting the city as we plan to again you will be pleased with Natalya and her tour service.\nIn addition to the major sites she took us to local restaurants, markets, little know areas and explained each in detail. It was like have a close family member take you under their wing and ensure that your trip is memorable. Excellence without comparison."
  },
  {
    "name": "a_r_h_p",
    "place": "Paris, France",
    "date": "May 27, 2014",
    "title": "Original Tours: well worth it!",
    "text": "First of all I must apologize to Natasha for procrastinating for so long in giving this review :( and hope she forgives me :)\n\nWe are independent travelers who like to do everything on our own versus being part of a tour group. When we need a guide, we hire a private guide for that particular destination\/site to supplement our agenda. In this case, we wanted to visit Tsarskoe Selo and Pavlovsk for the day and found Original Tours via Trip Advisor.\n\nOur trip to Russia was focused primarily on art and architecture so Natasha, being an art historian, was the perfect guide. She gave us insight into the art & history of each palace and the area in general where we would have floundered on our own despite having read all of the guide books. She also lent the trip a personal touch allowing us a view inside SPb which we would never have experienced otherwise. She even suggested adding the Siege of Leningrad Monument to the agenda to which I am grateful. This stop allowed us to truly appreciate SPb even more knowing what the people of SPb did to protect their homes and preserve their historical inheritance. We viewed the rest of our visit (7days) through different eyes afterwards because of this little side tour.\n\nWould I hire Original Tours again? Absolutely and we do plan a return visit to see everything we did not get to during our week in SPb.\n\nWould I recommend Original Tours? Without doubt and wholeheartedly.\n\nDoes Original Tours tailor to your agenda? Yes, anything can be customized to your needs.\n\nThank you Natasha."
  },
  {
    "name": "KGM-Boatworks",
    "place": "Boston",
    "date": "March 8, 2014",
    "title": "Art and Architecture Tour",
    "text": "I highly recommend Natalya for art and architecture tours of St. Petersburg. She is knowledgeable, engaging and committed to make your visit memorable. She makes the best use of your time with tours designed to fit you’re your interest and budgets. St. Petersburg is a wonderful city that is made even better with Natalya’s insight.\n\nKeith Moskow FAIA\nMoskow Linn Architects, Boston MA"
  },
  {
    "name": "PlanYourTripNYC",
    "place": "New York City, New York",
    "date": "November 7, 2013",
    "title": "Amazing tour of St. Petersburg",
    "text": "My book club spent four days touring St. Petersburg with Natalya. She was amazing in her breadth of knowledge of history, art, literature and places in St. Petersburg. Her English was perfect and she fielded constant questions. She tailored our tour to meet our unique interests. We saw the main city sites, but also had a private tour of the Dostovesky Museum. She lead us through Catherine's Palace and even got us into the grotto for a private concert by the singers. She had great restaurant recommendations and was fun to be with. I wish I could have her for all my vacations!"
  },
  {
    "name": "jodon",
    "place": "nj/az",
    "date": "September 26, 2013",
    "title": "Five Stars for Natalya and Tripadvisor",
    "text": "Thanks to the reviews of Tripadvisor members, we hired Natalya for a half day private tour of Catherine's Palace and other attractions.Natalya was supurb; she has a great knowledge of art, design and history and speaks English fluently. She is well-traveled, well-read and and also imparted fascinating information about the people and life of St. Petersburg that only a local would know. She was one of the highlights of our visit to this magnificent city."
  },
  {
    "name": "dbpollock",
    "place": "Moorpark, California",
    "date": "September 24, 2013",
    "title": "Wonderful Experience",
    "text": "My wife and I booked a private tour with Natalya for all three days of our stay in St. Petersburg. She created an itinerary based on our specific interests, which included a private cooking lesson at a local culinary institute and a stop at a local market. We truly felt like we were being shown around by a local friend rather than just a professional tour guide.\n\nNatalya's knowledge of art, architecture and history is astounding. Since she is licensed as a guide at all the major sites, she was able to escort us past long lines and focus our attention on the most important aspects of each room. Because of that, we covered far more ground than if we were in a larger tour group, and probably saw three times more than most tourists. We even rode on the Metro for a few stops and discovered a whole underground world of art and architecture.\n\nBecause Natalya was our driver as well as our guide, we had the opportunity to ask a million questions between sites where we learned as much about Russian society and history as we did at the palaces.\n\nIt was an ambitious tour and we were exhausted at the end of every day. Natalya not only kept up with the pace, she remained enthusiastic to the end. We couldn't recommend her more highly!"
  },
  {
    "name": "Sharyn150",
    "place": "Glasgow, Scotland, United Kingdom",
    "date": "August 27, 2013",
    "title": "Excellent Tour Guide",
    "text": "We recently were in St Petersburg in Russia. Natalya our tour guide was amazing. Her personality was charming. Her knowledge was unbelievable. She made excellent use of the time we had. She was able to get us into attractions without standing in massive lines. She was happy to accommodate our particular interests as well as showing us the sites of general interest.\nI would have no hesitation in recommending her and her company to anyone who wishes an interesting tour of St. Petersburg and the surrounding area."
  },
  {
    "name": "beckaj01",
    "place": "Birmingham, Alabama",
    "date": "July 31, 2013",
    "title": "Natalya is the best .....",
    "text": "Yes, this remarkable lady made our 3 days in St. Petersburg, Russia 'Extra Special'! We have never had a more knowledgable guide in all of my travels. Having studied Art & History & lived in St. Petersburg, she really knew her way around this city. There were 3 couples with her for the 3 days in a van where she served as our driver & guide. She was able to avoid most crowds --- it was like Magic !\nIn advance we were able to decide on what we wanted to see & Natalya arranged each day where every minute was full of adventure. One of the services that was provided was a Visa ! By providing her the needed information on line, she was able to obtain the needed Russia Visa for each of us. We highly recommend this charming outstanding guide !\nWe all 'Sing the Praises' of this fine lady ! Thanks again Natalya. We hope our travel paths cross again !"
  },
  {
    "name": "Frabble",
    "place": "Auburn, Alabama",
    "date": "July 29, 2013",
    "title": "Natalya Tsarkova is a wonderful guide!",
    "text": "I just got back from a wonderful trip to Saint Petersburg which included a superb two day tour conducted by Natalya Tsarkova. The tour covered the Peter and Paul Fortress, the Yusupov Palace, the War Memorial, the Cesma Church, the Catherine Palace, and the Peterhof. My tour companions continued on for a third day which included the Hermitage and an evening canal boat trip.\nNatalya is very knowledgeable (she has a degree in art history), speaks English very well and has a great personality. She was sensitive to when we needed a break and knew excellent places to stop for a meal. I felt that it would have taken me a week to see what we saw in two days plus it was much better than I could have done on my own because she selected meaningful sites and explained the significance of them beautifully. There was no standing in lines and travel to the various locations was as smooth as humanly possible.\nIt is well worth the money to hire her as your guide to Saint Petersburg. Great job Natalya!"
  },
  {
    "name": "DRDJ1",
    "place": "New Orleans, Louisiana",
    "date": "July 20, 2013",
    "title": "2-Day Guided Tour of St. Petersburg",
    "text": "My large family and I cruised the Baltic on Holland America Eurodam this summer and toured St. Petersburg with Original Tours-Natalya German-Tsarkova. Despite having travelled independently throughout Europe; due to multiple factors including expensive visa requirements, language barriers and transportation barriers we decided to hire a private tour guide. Cruise companies strongly promote their shore excursions and warn their passengers against hiring private companies but their tours are expensive and impersonal. After researching private options we selected Original Tours-Natalya German-Tsarkova because of their prompt and informative responses to our questions and value. I must say we made the right decision and were delighted with the service.\n\nNatalya and her personal assistant Anastasia Leontyeva made the process easy and reassuring despite our concerns about hiring a private company. After discounts we paid $1710.00 for a group of eight. The price included guide, transportation, driver, entry to all attractions and priority entry to the most important sites.\nAfter secure on-line payment we were sent tickets issued by a third party. These were accepted without questions at Russian Customs and we were greeted by Polina, our guide and Boris, our driver right outside the cruise terminal.\nA comfortable 16 passengers bus with a child seat for my 9-month-old grand-daughter was waiting for us. Natalya was unavailable due to a prior tour commitment and arranged for Polina's services. As soon as we buckled up in the bus, Polina plugged her microphone into the sound system, introduced herself and provided non-stop commentary during our 2 day tour. She speaks excellent English (in addition to Russian, German, Spanish, Greek and Italian). Her love of St. Petersburg and her knowledge of it's history, art and culture was impressive\nAfter an introduction to the history of St. Petersburg on the way into the city our first stop was St. Nicholas Naval Cathedral. St. Nicholas Naval Cathedral contains memorials to lost seamen and naval heroes, including those who died when the nuclear submarine Komsomolets sank in 1989. The interior portrays important episodes in Russian naval history. As always, Boris parked close to the site and magically appeared to pick us up to transport us to the next attraction.\nOur next stop was St. Issac's Square. Here we visited Tsar Nicholas I statue, Mariinskly Palace, the Angleterre Hotel and St. Isaacs Church. The massive dome of St. Isaac's Cathedral is made of 100 kilos of pure gold.\nNext we passed by the Admiralty, Palace Square, The Alexander Column, Decembrist Square and the Bronze Horseman on our way to Vasilevskiy Island. Polina issued warnings about pickpockets and even pointed them out to us to avoid. On Vasilevskiy Island we viewed the Rostral Columns, the Naval Museum, Sphinxes, Zoo museum and Kunstkammer. We also were treated to a great view of the Hermitage and Winter Palace from across the Neva.\nThen on the Petrogradskaya where we visited the Cathedral of SS Peter and Paul, the Neva and St. Peter's Gate, the cabin of Peter the Great and a souvenir shop where I found a dozen collectable souvenir metal buildings.\nWe then travelled to the Church on Spilled Blood with its beautiful murals and the Nevsky Prospekt.\nWe then met up with Natalya at Philip Davydov's Sacred Murals Studio for lunch. To save time, Natalya arranged for some pies from 'Stolle' restaurant. It's a chain of restaurants where they make great pies with different fillings, such as: chicken, salmon, rabbit, beef, - some sweet pies as well: with cottage cheese, lemon, apple and cinnamon, cranberries, plum, etc.\nPhilip was a cordial and informative host and we were able to learn about the art of Russian Icon Painting. In his studio we were able to see multiple icon's in various stages of completion.\nAfter lunch we visited Catherine Palace and Pavlovsk gardens for the remainder of the afternoon.\n\nReturning to St. Petersburg our group split up so that my wife, daughter's, son and son-in-law could attend the ballet at the Mikhailovsky Theatre and my granddaughter, younger son and grand-daughter could take a cruise on the Neva.\n\nNatalya transported our groups back to the cruise ship for the evening.\n\nThe following day we started with a multiple stop tour of the Metro with its unusually ornate stations. Boris then transported us to Peterhof for a tour of the spectacular fountains and gardens. Taking a hydrofoil back to St. Petersburg to same time, Natalya and Polina arranged for us the enter the Hermitage through a private entrance to avoid the crowds at the entrance.\n\nAgain Boris and Polina transported us back to cruise terminal. I highly recommend Original Tours-Natalya German-Tsarkova."
  },
  {
    "name": "Ropolonian",
    "place": "UAE",
    "date": "July 14, 2013",
    "title": "Loved St Petersburg!",
    "text": "We have just returned home from our holiday in St Petersburg.\nJulia was a fantastic guide. Very knowledgable! She looked after us very well and managed to get us around all the sites we wanted to see (plus a few other gems!) without the days being too long. Just perfect!\nHer back door entrance to the Hermitage then taking us in the opposite direction to all the crowds meant we could view everything without jostling for space. We were overwhelmed at the amazing beauty of all the palaces and churches and know we only just scratched the surface.\nTell Julia that our youngest daughters favorite church was the pink one she briefly detoured us to. She's calling it the Barbie church. :-) We just loved it all!\nThank you. One day hopefully we will return."
  },
  {
    "name": "C S",
    "place": "Austria",
    "date": "July 14, 2013",
    "title": "Great St. Petersburg experience",
    "text": "We are just coming back from a great 4 days in St. Petersburg thanks to Natalya's countless efforts to make this an unforgettable experience. I traveled with my parents and an 8-year old, so not an easy job to make everybody feel comfortable and on top of all that we needed a tour in German. Natalya still accompanied us most of the time and it was a pleasure to listen to her as she is very knowledgable and passionate about the sights in the city. I definitely recommend working with her."
  },
  {
    "name": "Denise Z",
    "place": "Zurich, Switzerland",
    "date": "June 24, 2013",
    "title": "City tour St. Petersburg",
    "text": "We started our St. Petersburg experience with a guided city tour and if you are not so familiar with history, that's the only way to go. We are still digesting all the information we received. What a wounderful tour. Thank you Natalya. Kind regards, Denise\n\nReview collected in partnership with this attraction\nThank Denise Z"
  },
  {
    "name": "E B",
    "place": "NYC",
    "date": "June 18, 2013",
    "title": "A special experience",
    "text": "Private guides are the way to go in St Petersburg, and Natalya was knowledgeable, generous and well connected, making it easy for us to bypass lines, see sights off the beaten path and have a wonderful experience. Definitely recommend working with Natalya.\n\nReview collected in partnership with this attraction\nThank E B"
  },
  {
    "name": "noahrosenblatt",
    "place": "Chicago, Illinois",
    "date": "May 28, 2013",
    "title": "A unique, memorable Russian experience",
    "text": "Knowledge: It felt like Natalya could write books on both Modern Russian and Art history, and present it in an accessible manner. When I told her I tend to quickly bore at museums, she said that as a student of art history she could make the visit to the Hermitage memorable and she did. We even learned a few things. Natalya was able to get us entrance at a quiet, off the path location which let us see some of the masterpieces with no one around  which even she said was special. While driving in the city it seemed that Natalya provided historical context about almost every building we passed.\n\nPersonality: Natalya speaks great English and is at ease interacting with foreigners. It was interesting to hear her speak about growing up under communism and of the differences between the Soviet Union and Russia She was almost always smiling, cheerful, and outgoing even after we accidentally slept in and made her wait over an hour after our scheduled meeting time. If she doesnt mention it, ask her about how she helped in the film the Russian Arc  its pretty cool.\n\nFlexibility: It is difficult to describe the personal touches Natalya provided. When emailing, I told her my wife and I like to interact with local artists and although I wasnt quite sure what I meant, Natalya seemed to figure it out. She took us to the workshops of 2 local artists, a porcelain painter and an icon painter. It was very memorable getting to talk one-on-one with the artists, to see their homes and workshops and their techniques, and to experience true Russian hospitality. We also received a wonderful tour of one of the most famous art schools in Russia by a professor in metallurgy - very unique. Finally, even though it was finals at the Vaganova school of ballet and tours are not allowed, Natalya was able to get us one. The bottom line is, if there is an experience or activity youd like then let her know and Im sure shell try and figure something out. Dont feel obligated to visit only tourist attraction with Natalya.\n\nValue: When I chose Natalya she was one of, if not the highest rated small business\/ individual private tour guides listed on TripAdvisor (we tend to avoid large companies and feel it is worth the extra for the personal service) and her prices seemed to be one of the best (remember everything is more expensive in St. Petersburg). Based on our experience it was certainly a great value.\n\nOverall: We booked 3 days with Natalya, and while Im sure you can see the city in less time you may miss some things. If you have more time, Id suggest 3 or more days with Natalya but make sure to specifically plan some time to explore on your own. It is not that we didnt have this time it was just always after a long day of sights and we were pretty worn out to take advantage."
  },
  {
    "name": "Graham E",
    "place": "Calne, United Kingdom",
    "date": "May 27, 2013",
    "title": "The best way to see St Petersburg and its treasures",
    "text": "At the beginning of May we had 6 days in St Petersburg. I am not sure how my son and his wife, who live in Moscow, found Natalya, but they kindly arranged for our party of 5 to be shown all around St Petersburg as well as the neighbouring Peterhof, Oranienbaum, Kronstadt Island, Tsarskoye Selo and Pushkin City. They chose very wisely. We were taken around in Natalya's comfortable people carrier which enabled her to point out the places of interest along the way. As a graduate of the St Petersburg Academy of Art, her knowledge and enthusiasm for the amazing collections was quite evident and, particularly in the Hermitage where there is so much to see, she was able to take us straight to the works of art of special interest to us. She spirited us past the queues and enabled us to pack in a massive amount in the short time we had available. Without her we would not have been able to have had such a memorable and enjoyable visit. She speaks excellent English and clearly enjoys talking about the history of St Petersburg. She even took us to a couple of her artist friends, one of whom showed us how he ground and mixed the pigments in the traditional way for painting icons. I have no hesitation in recommending Natalya as an outstanding guide for anyone wishing to explore and understand this fascinating city."
  },
  {
    "name": "poipu67",
    "place": "Petaluma",
    "date": "May 26, 2013",
    "title": "Outstanding guide for St. Petersburg",
    "text": "In this amazing city it is easy to be overwhelmed and you really need a very good guide. Natalya is absolutely outstanding and has a vast knowledge and passion for her city. She has the ability to get you into places that most tours cannot take you. She also can set up private parties if you want to celebrate something truly special. She is a true gem in a city filled with treasures. She is also an excellent driver!"
  },
  {
    "name": "Lagunakiwi",
    "place": "Laguna Beach, California",
    "date": "May 16, 2013",
    "title": "St Petersburg",
    "text": "Natalya made our short stay very memorable.. We crammed a lot into two days. Much to see and do in St Petersburg. We all enjoyed her company and everything we saw. I would recommend a lunch reservation as part of any tour ( If it you are going to be with someone for 8 hours). You can learn as much form having a meal with a local as you can seeing another museum!\nI would definitely recommend Natalya to anyone visiting St Petersburg!"
  },
  {
    "name": "John I",
    "place": "Nottingham, England, United Kingdom",
    "date": "May 9, 2013",
    "title": "Best guide we have ever had...John & Jayne UK.",
    "text": "St Petersburg was fantastic and made all the better by Natalya who amazed us with her knowledge and enthusiasm. Every visit was a wealth of history and information, she feed us with stories and painted pictures that brought the cities treasures to life. Natalya was professional and fun. I would defiantly recommend her without reservation. Thanks Natalya for making our visit one that we will remember for years to come."
  },
  {
    "name": "abo199",
    "place": "long eaton",
    "date": "May 9, 2013",
    "title": "Highly Recommended!!!",
    "text": "My wife and I together with 2 friends spent 5 wonderful days in St Petersburg\n\nFor 3 of those days Natalya showed us some of the main sites in spectacular fashion including\n\nHemitage\nPeterhof and Pushkin\nCity Tour\n\nTogether with a smoothly organised Airport transfer\n\nNatalya was an excellent companion both in terms of knowledge of the city but also her love of the spectacular artefacts. Having been to some of the other famous art galleries of the world including the Prado in Madrid we did n't know what to expect but WOW were we impressed. Natlaya brought her passion of the country to bring many of the sites to life.\n\nWe also learnt much about the Russian way of life through her honest and informative outlook. If you are looking for a honest intelligent and amusing guide you can't go wrong with Natalya German-Tsarkova"
  },
  {
    "name": "jkogan1",
    "place": "Chicago, Illinois",
    "date": "April 24, 2013",
    "title": "Exceptional Tour Guide",
    "text": "My family and I spent two wonderful days in St. Petersburg. Our exceptional and informative tour guide Natalya arranged everything from pick up at our hotel, booking tickets, to leading us on private tours of the city, cathedrals, palaces and Hermitage museum. All the tours were just excellent. Thank you for a wonderful experience!"
  },
  {
    "name": "Traveler5548",
    "place": "Clearwater, Florida",
    "date": "February 26, 2013",
    "title": "First rate tour guide",
    "text": "Five (5) wonderful event filled days in St. Petersburg and surrounding countryside with Natalya. As an art history major, Natalya brought to life the wonders of the czars. And she did so much more on a personal basis including a local family visit, and unique restaurants. By the time our stay ended, it was like leaving a friend. Natalya has a wonderful van equipped with sound system so those in the back will not miss the continuous narration. And in the museums is where she shines. Natalya just lights up as she takes you traveling through Russian history, religious culture and art from Peter I to Nicholas II. Highly recommended"
  },
  {
    "name": "T B",
    "place": "wokingham",
    "date": "February 12, 2013",
    "title": "Great organisation",
    "text": "We had limited time in St Petersburg, but Natalya made absolutely the best use of it for us. Her knowledge and expertise were excellent and her personality and charm made every moment a pleasure. We learnt much about the history and the things that interested us, and our tour of the Hermitage was the highlight of the trip. Can't recommend Natalya enough."
  },
  {
    "name": "Jackerson J",
    "place": "Vancouver, Canada",
    "date": "February 9, 2013",
    "title": "Natalya and St Petersburg...Both Exceptional",
    "text": "In June, 2012 my wife and I had the great pleasure of being introduced to St Petersburg by Natalya German-Tsarkova. Both are exceptional! Originally, we planned three days for St Petersburg...two on our own and one with Natalya as our guide. After further reading, we changed and ended up spending six days in the city and five full days with her. And they were crammed...but at our chosen pace. We came away with a love for the City and great confidence in Natalya.\n\nNatalya's education is in art history and she brings from this a very knowledgeable, and perceptive understanding of five centuries of European art. This broad knowledge also enables Natalya to be very focused. And in vast museums like The Hermitage, this is extremely helpful for visitors , who wonder how they can see 'everything' in St P in a few short days. For example, in The Hermitage, with its thirty plus rooms\/galleries devoted to Italian painting and sculpture, Natalya moves through the hoards of people to a particular room and art work.....but stopping on the way to talk about something of note in another gallery or 'hall'. She'll then give biographical\/ anecdotal information about the chosen painting, the painter and his period, and why his works (or work)are considered so special. And she'll provide the historical context and comparisons with others of the period.\n\nWe found Natalya was also very sensitive to our suggestions and interests. For example, because we had talked about it so much, she changed our schedule to allow a few hours at the Siege Memorial. And again, she was very knowledgeable and passionate about the period. Also, the next day, when we were on our way out of St P (to see one of the summer palaces), we asked about the metro or underground. At once a small detour and we were parked and Natalya was getting the tickets. Then two firsts for me....the longest metro escalator, and the longest ride between stations. The whole system, stations and cars were most impressive. Also on this detour, because I had been asking about apartments and housing generally in St P, Natalya took us through neighborhoods with modern (and vast) new apartment complexes as well as buildings from both the Stalin and Art Deco periods.\n\nNatalya's inclination to anticipate what different customers might find of interest was also shown when we were talking about Russian ballet. The Mariinsky Ballet had taken June off but one day, while in The Hermitage, Natalya heard that the Hermitage Ballet company was performing that night. After checking with us (it was Giselle which we like) she phoned immediately to reserve tickets. Because we would now miss dinner, Natalya, on our way back to our hotel, after picking up the tickets, took us to the fabled Idiot Restaurant (Dostoevsky inspired) for a late afternoon snack. This, despite making her late for her family. But it was something we had mentioned earlier. When she finally dropped us off she also had detailed directions on how to walk to the Theatre, in the Hermitage, from our hotel (the hotel, itself, was Natalya's recommendation and it was excellent). With all Natalya's thoughtfulness, it turned into a delightful evening to be in the exquisite theatre of Catherine the Great.\n\nAnd wherever we were in the City (or outskirts, going to the rural palaces), she constantly pointed out buildings, bridges, canals, churches, palaces, statues etc of special interest, and their historical\/political\/cultural significance. She covered everything on our 'must see' list many times over.\n\nLastly, I must mention that Natalya's van is very comfortable, she uses a mike, is a good driver and if parking wasn't immediately available, she would always drop us off near the entrance, find her parking and rush back to join us. It never took long.\n\nWe cannot say enough about Natalya as a guide for St Petersburg. She is very knowledgeable on art, architecture and history, committed to the City...and to her customers....and very pleasant to be with.\n\nNancy & Jack Jefferson, Vancouver, Canada"
  },
  {
    "name": "susu_in_nyc",
    "place": "New York City, New York",
    "date": "February 3, 2013",
    "title": "Simply the Best Tour One Could Ask For!",
    "text": "You will find many superlative remarks about Natalya in the comments that follow. Prior to my trip to St. Petersburg in October 2012, I read these reviews and, as a result, my expectations for a day with Natalya were high. Much to my delight, Natalya exceeded my expectations. She combines the knowledge, expertise, and perspective of a skilled tour guide with the warmth and enthusiasm of a gracious host. St. Petersburg is a city she loves and she will bring it to life for you.\n\nOur day included visits to Catherine Palace, Pavlovsk, and Alexander Palace. Although Alexander Palace is not a standard stop on most outings to Tsarskoe Selo, Natalya accomodated my request to visit the favorite home of Nicholas II. The palace offered wonderful glimpses into the life of Nicholas and his family. From Nicholas' study to dresses worn by the Grand Duchesses to Alexi's toys, I loved these 'snapshots' of everyday life in the waning years of Imperial Russia. I recommend Alexander Palace to other tourists.\n\nNatalya encouraged me to include a visit to the Siege Memorial in my itinerary. I was not disappointed. This moving tribute to Leningrad's resistance offered sobering lessons and served as a poignant contrast to the grandeur and beauty of the restored city of St. Petersburg.\n\nPerhaps reviewer David S states it best in describing his time with Natalya: 'We met as guide\/tourist and parted as friends.' Natalya's professionalism and thoughtfulness made my day a delight from start to finish. I earnestly hope to visit St. Petersburg again and will be sure to include Natalya in my plans. Be sure to include her in yours!"
  },
  {
    "name": "David S",
    "place": "Milliken, Colorado",
    "date": "November 8, 2012",
    "title": "Amazing Natalya",
    "text": "This summer we had two days off a cruise ship in St.Petersburg. Friends had written of Natalya in their Christmas letter, describing her as the highlight of their trip, even including her website address in their letter. Now that's a recommendation! So the four of us booked Natalya for late July. Now she will be in our Christmas letter- as the highlight of our trip. We met the first day as guide-tourist, and parted the second day as friends.\n(And if your visiting St. Petersburg, don't even think of going out on your own. NOT a good idea.)\nThank you again, Natalya for all you did for us. You were a blessing.\nDavid S.\nColorado"
  },
  {
    "name": "E and V S",
    "place": "Sydney, Australia",
    "date": "November 5, 2012",
    "title": "Natalya, you are the best! - E&V, Sydney",
    "text": "We just returned home from around the world trip & one of the most unforgettable experiences was our 6-day visit to St Petersburg. The city is fantastic, has a lot to offer & we were especially lucky to see it with the help of our knowledgeable, enthusiastic & simply delightful private guide Natalya German-Tsarkova. We contacted Natalya on Tripadvisor's recommendations, spent a year corresponding & planning the itinerary & finally met at Pulkovo airport on 10th of September. Always punctual, resourceful & entertaining, she was often above & beyond of what we expected & proved a caring & selfless hostess. Her warmth was especially appreciated as we spent long hours together & at all times felt comfortable in her company. Her love of the city is unmistakable & contagious, her knowledge of history, art & architecture made visit to every museum, palace & church an eye-opener. Natalya is equally fluent & articulate in Russian & English (both my husband & I are bi-lingual, so we know!). Our friends engaged her on our recommendation & were equally impressed & happy. Top marks, Natalya & many thanks from us."
  },
  {
    "name": "Laural H",
    "place": "Meridian, Idaho",
    "date": "September 21, 2012",
    "title": "Book with Natalya - you won't be disappointed!",
    "text": "We were in St. Petersburg last June (2012) for 4 days on a river cruise. We booked with Natalya for a full-day's tour of the Hermitage, a half-day tour of Peterhof fountains, and city tour and tour of the Yusupov palace. The cruise company changed the itinerary at the last minute, and Natalya was able to accomodate the changes with no problem! As other commenters have said, Natalya speaks excellent English, is enthusiastic about her city, and is able to relate details about the surroundings and its history in an interesting and enjoyable way. She guided us to all the important things at the locations we visited (somehow magically avoiding crowds), and was sensitive to the needs of everyone in our group.\n\nDue to our change in itinerary, Natalya was unable to take us on the tour of the Yusupov palace, but we were more than adequately taken care of by her associate, Alexandra, who was equally knowledgable about the palace and was expert at avoiding the crowds so that we could view the rooms on our own. She even escorted us afterwards to the resturant where we were going for dinner so we didn't get lost!\n\nThe time spent with Natalya, and with Alexandra, was worth every penny. We all agreed that we made a new friend who we want to see again if (when?) we return to St. Petersburg."
  },
  {
    "name": "WilliamNYC61",
    "place": "New York, New York, United States",
    "date": "September 19, 2012",
    "title": "She is terrific",
    "text": "We spent four days in St. Petersburg during August 2012. Natalya was recommended to us by a friend. Our friend said that she was excellent. She undersold Natalya. Natalya is everything guide should be and more. Not only is her English excellent, and she is always on time, her knowlege and enthusiasm for her city and her country is infectious. Whether it is knowing her way around the Hermitage, discussing the musical and ballet offerings on during our visit, or recommending restaurants, she was a joy. Her knowlege of art, and her appreciation of style brought a special pleasure to our visit to the city's museums and palaces. However, it was a visit to the memorial to the war dead and to the siege of Leningrad whch demonstrated her deep feeling for her city and her country, which only added to our appreciation of her wonderful and justifibly famous city. She is simply terrific and everyone going to St. Petersburg should try to see it with her."
  },
  {
    "name": "carkish",
    "place": "New York City, New York",
    "date": "September 12, 2012",
    "title": "Two wonderful days in St. Petersburg - Carolyn, Arthur, Diane, and Mike from the USA",
    "text": "We just returned from a cruise to the Baltic where the definite highlight was our trip to St. Petersburg and more specifically our private tour with Natalya German-Tsarkova. There were four of us who were greeted at the debarkation point of our ship as planned before our cruise from the United States. Natalya immediately made us all feel comfortable. She has a beautiful six person van waiting for us close by. Before we took off she gave us a brief orientation of the city and a history of the city. She then laid out the plan for the next two days which included all the major highlights of St. Petersburg. We were never disappointed. We were brought to the sights within short walking distances. She managed to always get us passed the long lines that both the independent visitors and the excursion tourists were waiting on. When in the mini van she gave us detailed historical data told in an always interesting mannner with both an historical and artistic perspective.She shared her extensive knowledge of the background of the city and wove into it her excellent knowledge of art . This helped us to make the most of our tour of the Hermitage where she managed to give us a chronological art tour that was incredibly thorough even though we were so limited on time. Throughout the tours we always felt her enthusiasm and love for her city and all the cultural advantages that were numerous throughout. The sound system in her van helped us to never miss any information. She also took us to several resturants which we thoroughly enjoyed. Unfortunately the weather was not cooperative which made us miss a boat tour that we had planned for the evening. However we spent the time touring the city in her van and learning more about the beautiful architecture of the city. We would highly recommend her to anyone planning to visit this city. Her intelligence, knowledge and warm personality made this a memorable experience."
  },
  {
    "name": "activeoneCa",
    "place": "CA",
    "date": "September 10, 2012",
    "title": "Use Natalya instead of a group tour!",
    "text": "We really enjoyed our tour with Natalya as our guide. We highly recommend her as a guide if you are wanting to do all the basics to see in St. Petersburg. Natalya knows her history, and has a routine which works. (We had a few minor comments that affected her excellent rating.)\nNatalya is an art history major, and has an excellent historical grasp of the city. She can drive, and talk with a microphone, so you can hear her comments as you go by sites. She is open to questions.\nNatalya always responded to emails. She did want payment in advance, and I did send a deposit. She is trustworthy!\n\nWe used Natalya's services for 2 full days. At the start, Natalya was 5 minutes late, but then she was there. The guides line up with your name, so when we didn't see her, we were slightly worried, but then she was there. Right away she took us to spots to see, and explained them all, and had excellent historical information. She is clear, and interesting and informative.\n\nShe took us to all the major sites of St. Petersburg. We got in every site without waiting, and at the Hermitage walked right in, ahead of everyone. We went at a perfect time, in between crowds, and it was wonderful. Natalya not only explained the art we saw, but I learned about art in general as well. This in itself is an advantage over a group tour!\n(One tiny negative was that we wanted to see one area I had asked about in advance, which she said we could not see due to time. She did not know about the area, and I think she has a schedule and knows what works and wants to stick by it. However, a little flexibility would be good.)\n\nWe had local food which was perfect.\nShe did take us to a store for souvenier shopping, which was more expensive than a store I found on Nevsky Prospect. The store did have good quality items.\n\n(We would have liked to stop to take a picture of a few sites when we drove by, but Natalya said there would not have been time. I think this is another time when the extra minutes at 5 sites over the two days would have been worth it. We did have time at the end of the first day to have covered that time.)\n\nThe second day Natalya was there on time, and we drove out of the city. Natalya is an excellent driver, and there are no safety issues. She again was knowledgeable, and is wanting to start her own travel agency. It was great talking to her about all different subjects.\n\nOur lunch the second day was at a traditional restaurant which was good, but was not quick like we had wanted. (We would have preferred using that time to take pictures of the sites.)\n\nRussia appears to be a conservative country at this time, and Natalya shares some of those views, which is different than liberal California. It was interesting getting Natalya's thoughts on everything from politics to abortion.\n\nWe did see a subway, but it would have been nice to ride the metro and see a fancy subway, as some of our cruise guests said they did and told us about.\nI had also wanted to drop off donations at an orphanage another guide told me about, but Natalya said we could not do that either.\n\nBesides those minor things, Natalya was wonderful. We covered all the basics of everything to see, and she included taking us to the Siege Museum which has important historical information presented in an interesting way. Natalya is honest, informative, excellent at art history, and a guide I would highly recommend for individuals or families!"
  },
  {
    "name": "DHCWESTON",
    "place": "Weston, CT",
    "date": "September 5, 2012",
    "title": "A Great Guide For St. Petersburg",
    "text": "My daughter and I had just two days to spend in St.Petersburg and chose Natalya as our guide. She did a great job showing us the highlights of the City. She is extremely knowledgeable and very professional. She is particularly strong when it comes to the architecture and art of the City. Her tour of the Hermitage was outstanding -- we even managed to view the Da Vinci works alone in advance of the crowds. She had many interesting anecdotes and even our walks through the St. Peterhof gardens were extremely pleasant. She covered alot of ground in a short time and was sensitive to our needs at all times. She didn't hesitate to offer her political views and personal perspectives but had a firm grasp of the history. We would strongly recommend her to travelers."
  },
  {
    "name": "Lucie468",
    "place": "Montreal, Canada",
    "date": "September 1, 2012",
    "title": "Fantastic two days in St.Petersburg",
    "text": "My husband and I were on a cruise so we had only two days to spend in St.Petersburg; we wanted to make the most of those two days. After contacting Natalya, we explained to her that we wanted a private tour and we trusted her to show us the highlights of this beautiful city. She did not disappoint us. It was a wonderful two days and, as a bonus, the weather was great! She was well organized and extremely knowledgeable. Throughout the tour, it was clear that she has a great knowledge of the history of the city, knows very well art history and she's very passionate. It was great to tour the Hermitage Museum with her! Giving the short time we had, she was able to bring us to the most important exhibits and explained them very well. Her knowledge of the Romanov family was extensive and, again, every palace or garden we've visited, she was able to put it into their respective historical context. If it wasn't for her, we would not have visited some interesting places like the War Memorial. Even lunches were fun as we discovered some typical russian cuisine. She speaks perfect english, is very professional and was always on time. We recommend her without hesitation!\nLucie & Jean-Pierre\nMontreal, Canada"
  },
  {
    "name": "lenchoCalif",
    "place": "California",
    "date": "August 29, 2012",
    "title": "A High Recommendation for Natalya of Original Tours",
    "text": "This past summer my husband and I had the privilege to visit Russia for three weeks as part of our two-month vacation. We are experienced travelers and wanted an experienced guide for St. Petersburg. Upon reviewing the internet, we came across the rave reviews of Natalya in St. Petersburg. We were new to Russia and wanted a first blush and some depth to our visit. We used the services of Natalya German-Tsarkova of Original Tours for 4 days and were thoroughly pleased with our decision. Her English was splendid and her knowledge of her country's history was just what we wanted. Our perspective of Russia was typically American biased, yet we craved her perspectives. Natalya corrected us on many occasions and gave us her unbridled viewpoints. We didn't have to agree necessarily, but we admired her passion and applauded her passion about her country nonetheless. Why else would we have come? On many occasions we wanted her to stop with the history and let us capture on film the beauty of what we were witnessingshe eventually relented. She would back off and allow us our absorption. A trip cannot be enthused without the genuine feelings of the guide permeating the day's presentations. We loved her knowledge and the passion she showed us in presenting a glimpse of her Russian empire.\nA quick note: Natalya is coming to visit us in America soon and we want desperately to give her, in return, a quick glimpse of our American life. I believe we have made a friend."
  },
  {
    "name": "maria isabel v",
    "place": "cali",
    "date": "August 28, 2012",
    "title": "A wonderful experience",
    "text": "Natalya is a very professional working woman. We had a espectacular experience on St Petersburg with her. it is a very interesting city and with the guide of Natalya was very special. We learned a lot of history and my 13 years old daughter says that she was the best guide of all our trip. She explained the Hermitage with simplicity and remarking the diferrent styles.\nWe stayed for 4 nights and it was perfect for us!! We also learned and tried about the Russian food.She told us where to have a good lunch and dinner!\nI really recomend Natalya as an excellet guide!"
  },
  {
    "name": "Fleetcat",
    "place": "Ko Samui, Thailand",
    "date": "July 30, 2012",
    "title": "I can only agree with the rave reviews.",
    "text": "We booked Natalya directly online a few months before our Baltic Cruise based on the reviews on Tripadvisor and would highly recommend you do the same. Our main concern about going it alone was a bit of scaremongering amongst the cruise community that a visa in Russia might be an issue without official tickets. While it was true that you absolutely needed official tickets to get through immigration, Natalyas tickets held the same value as any issued by the ship and everything went totally smoothly.\nUnfortunately my husband had a bit of a cold during our visit so we were possibly not the most receptive guests. Also we both have relatively short attention spans and find we can whizz round museums far faster than most. Natalya got our measure and adjusted her pace to suit us while making certain we didnt gloss over the magnificent St Petersburg too much.\nHaving the same guide for three days was a great solution for us  particularly with such a charming and beautiful one. As well as covering the main attractions we ate authentic food at three completely different lunch venues , saw some smaller sights that gave us a different spin on the city and Natalyas passion for her subject was totally infectious. I agree with every rave review here."
  },
  {
    "name": "Jose A L",
    "place": "New York City, New York",
    "date": "July 6, 2012",
    "title": "Outstanding, knowledgeable and charming, Natalya made our stay in St. Petersburg most memorable",
    "text": "Natalya was very highly recommended to us by friends who had visited St. Petersburg recently. In our experience, she was an outstanding tour guide, driver and translator. During the five days we stayed in St. Petersburg, she showed us the most important sites in and around the city and introduced us to several typical Russian restaurants that we enjoyed very much. Her background in art history and her knowledge of architecture and Russian history, especially as they pertain to St. Petersburg, made her a unique guide to the many museums, fortresses and palaces in and outside of this incredible city. One of the most moving experiences was our visit to the Siege of Leningrad Memorial from WWII. Her knowledge of the history of WWII, and Russian history in general, was truly impressive and contributed significantly to our understanding of Russian culture and character. For us, the fluidity by which she translated the comments made in Russian by the many museum guides was extraordinary. Natalya also provided invaluable assistance when planning for the trip, recommending an itinerary packed full of the most important and impressive sites. She helped us select an opera performance (even recommending the best seats) and helped us secure train tickets for our onward journey to Moscow. And to top it all off, she is a delightful person, someone that was very easy to talk to and with whom we very much enjoyed spending five days. We strongly encourage anyone interested in an in-depth tour of St. Petersburg and its environs to consider Natalya because she will make it an extraordinary experience that will exceed your expectations."
  },
  {
    "name": "barbara n",
    "place": "Santa Fe, New Mexico",
    "date": "June 23, 2012",
    "title": "saw more than we thought possible in our time limit",
    "text": "my friend and i had 6 days in st. petersburg. there was so much to see, we decided a private guide was the only way to get everything in. after much research, i decided on natalya.\nher e-mails were prompt and her suggestions were perfect. she was very business-like about payment, and there were no problems. she explained every charge carefully. at peterhof, the line at the opening was thousands long. natalya stepped to the front of the line at the entry, talked with the doorkeeper and we stepped inside. we had moments inside before the crowds. this alone was worth her charge. at catherine's palace, we walked in and although she kept us moving as required, we were able to go more slowing than the huge groups we saw around us. i would advise anyone going to st. petersburg to use natalya rather than book themselves into a group tour. it is work the money to see so much and never be in a crowd."
  },
  {
    "name": "Snitchbolt",
    "place": "Perth, Australia",
    "date": "June 11, 2012",
    "title": "A truly fantastic way to see SP",
    "text": "We are a family of 4 (with 2 young boys) and we recently spent 5 days with Natasha, where she looked after us superbly. Natasha was extremely knowledgable in relation to everywhere we visited and in particular in relation to the history of Saint Petersburg and the art and architecture of the nearby palaces and other sites.\n\nSaint Petersburg is truly an interesting place with so many different aspects to experience. The people of SP suffered enourmously during WWII and under the rule of Stalin and yet the feel of the place and the spirit of the people is fanstastic.\n\nWe managed to see most of the major attractions on our tour. Natasha was able to help us to jump the long lines at most venues and where that was not possible she worked her magic to get us in quicker than normal. At times things were a little rushed but there is a lot to see in SP and you need to allow yourself plenty of time to do it properly.\n\nHer English is almost faultless - she speaks fluently and you will have no trouble at all conversing with her. She was very good with the kids and got them involved even when their interest was lagging.\n\nNatasha drives her van and commentates at the same time and it generally works very well. The van is large and modern and had seat belts for everyone, which was important to us. She picked us up each day from our hotel and returned us again to the hotel at the end of the day. She also showed us how to use the metro.\n\nHer style was both informative and pleasant. We very much appreciate her guiding us on our recent tour of Saint Petersburg."
  },
  {
    "name": "joseccv",
    "place": "Rio de Janeiro, RJ",
    "date": "June 9, 2012",
    "title": "Our thanks to Natalya from Jose and Maria",
    "text": "Myself and my wife had 5 great days in St. Petersbourg thanks to Natalya great job. She was able to find an excellent Portuguese (our native language) speaking guide and did all planning, transportation and tickets. We entered all atractions without going to lines. We will recommend Original Tours to our friends going to visit this fantastic town."
  },
  {
    "name": "Donna N",
    "place": "Houston, Texas",
    "date": "June 2, 2012",
    "title": "Donna N Excellent Tour Guide",
    "text": "My husband and I and another couple spent two days touring St. Petersburg with Natayla. We had her name from a relative who spent 5 days touring St. Petersburg and highly recommended her. We were not disappointed. Natayla is very knowledgeable, organized, efficient and cost effective. Her English is flawless. We gained immediate access to all sites, never waiting in lines. The visit to the Hermitage was very rewarding as she is an art historian. My husband got ill on the trip and Natayla kindly accompanied us to the Western Medical Clinic. I have referred her to several people, all of whom were pleased and rave about her tour services. We highly recommend Natayla and would use her again!"
  },
  {
    "name": "Blessedgreatly",
    "place": "sydney",
    "date": "May 4, 2012",
    "title": "A great way to see St Petersburg with children",
    "text": "We are a family of five with three children 12 and under and spent two days with Natalya fitting a lot in.\nWe had a slow start, waiting to be picked up from the port the first day { make sure you confirm pick up time} but after that our exploring was full speed ahead.\nNatalya is an art historian and was really good with explaining and showing things to the children and holding their interest, being a mother of three young children herself.\nWe hit a speed bump when our camera was stolen in St Issac Catherdral and Natalya helped us fill out a police report, not an easy task in Russia.\nWe saw most of the major sites,museums and palaces in St Petersburg, skipping most of the long queues which is a must with kids in tow.\nIt was great travelling around in a car and not having to wait for lots of other people.\nWe would highly recommend her."
  },
  {
    "name": "George O",
    "place": "St. Petersburg, Russia",
    "date": "January 4, 2012",
    "title": "Outstanding",
    "text": "Our tour guide Natalya was outstanding. For 3 days she picked us up everyday at the dock where our cruise ship was located and returned us after each day was over. Because my father in-law and mother in-law had some health problems that we did not inform her of when I booked her (on-line) she made adjustments to accomodate them while keeping my wife and I satisfied with our tour wishes. Not only was she very knowledgeable about her country but very pleasant to look on. We had a fanastic time and also got to eat some great Russian food. Best of all we became friends and have invited her and her family to come to the USA to stay in our home. St. Petersburg, Russia has so much great history, museums, and castles."
  },
  {
    "name": "Margiecohen",
    "place": "New York City, New York",
    "date": "December 1, 2011",
    "title": "Five-Star Guide",
    "text": "For the five days my husband and I were in SP, Natasha was our incredible guide. From the minute she picked us up at the airport till our departure, she did everything to make our stay fabulous. Natasha ia an art historian so all our experiences at the Hermitage, Peterhof, St Catherine, etc. were truly memorable. But it was all the little things she did that made her stand out as truly exceptional, from getting tickets to the Krov ballet, restaurant recommendations, Russian invitation, and so much more. Her only wish is to make your vacation the best. As you can tell, we highly recommend Natasha when you are in St. Petersburg."
  },
  {
    "name": "alexvaresident",
    "place": "alexandria, va, usa",
    "date": "November 13, 2011",
    "title": "Charming, Superior St. Petersburg Guide",
    "text": "We toured with Natalya for our first three days in Russia. From the moment she picked us up at our hotel, we felt we had made a friend. Charming and personable, she has extensive knowledge of St. Petersburg's history, art and architecture, which she shares with enthusiasm. Her art education makes a visit to The Hermitage and the Russian Museum a delight, and her understanding of architecture helps you to see details you otherwise would not have noticed. She chauffers you around in her comfortable van, maneuvering around St. Petersburg's streets as only a native can -- making getting from place to place a breeze. We enjoyed hearing about her life, her family and life in Russia in general. She is a lovely person who strives to ensure that you are getting everything you can out of your time in her city. We can not recommend her highly enough."
  },
  {
    "name": "SofaKingdom",
    "date": "November 11, 2011",
    "title": "The highlight of our trip",
    "text": "I can go on about all of the great places we saw on our trip, but the bottom line is that Natalya made our visit to St. Petersburg as spectacular as it was, and it would have paled in comparison without her. We spent 3 days in St. Petersburg, and hired Natalya for 2 of them. We felt lost on the 3rd day without her. I had looked at many different packaged trips with other tour providers, and also Natalyas suggestions, but we were really looking for a customized trip. We sent her a list of sites we wanted to see, and how interested we were in the various sites, and kept our fingers crossed as we thought we were being a bit aggressive trying to fit in as many places as we were in 2 days. Natalya came back with an itinerary that was exactly what we were looking for.\n\nNatalya picked us up at our hotel, and off we went. Her English is perfect, with only the slightest accent. Over the course of our visit to St. Petersburg and Moscow, we had the opportunity to hear many other 'English Speaking' tour guides, and Natalya's English was head and shoulders above the rest (my apologies to our guide Mikael in Moscow, whose English was very good). Natalya's knowledge of history, and art was amazing. We also discussed classic Russian and soviet films I had watched leading up to the trip, and the latest things going on in the US. While driving around, she was a pleasure to talk to about all sorts of things Russian, and American. We got so much more information and enjoyment out of each location from going to places with her than you ever could on your own. Unfortunately I got to find out what it would be like without her on our third day. I should mention that I can read a map with no problem, can read Cyrillic, am great with directions, and my girlfriend is a native Russian speaker, so we wouldn't have been helpless Americans without her. That being said, we would have never been able to have an experience even remotely close to what we had without her. As a licensed guide, she is able to use special ticket lines, and entrances. Additionally, she knows the ins and outs of these places like she lived there as a child. We were cutting through entrances I would have never considered using on my own.\n\nShe packed everything we mentioned we wanted to do into the two days, and we always had time for a nice, long, relaxing lunch of traditional, authentic Russian food. At the end of each day, she would give us suggestions of more things we could do, and places to eat. It felt strange getting dropped off at the end of day two, knowing we were on our own from then on.\n\nNatalya was without a doubt the highlight of our trip, and we will definitely contact her when we go back to St. Petersburg. I wouldn't think of seeing it any other way."
  },
  {
    "name": "chingha63",
    "place": "new york",
    "date": "September 6, 2011",
    "title": "The best 2 day St. Petersburg tour",
    "text": "Natalya was the highlight of our trip to Russia/St. Petersberg .Being a family of 5, we had come up with a 2 day itinerary prior to our visit and Natayla made sure we saw everything! Not only is she a wealth of information but also a wonderful person. Our tour began with an overview of the city with stops to visit St. Issacs Cathedral, Yusapov Palace, The hermitage,The Idiot cafe, and other highlights\n\nThe second day we visited the Siege museum on the way to The Summer Palace and Peterhoff. (see her website for great suggestions,or ask her. She responds quickly!) I cannot say enough about her passion,love and knowledge of her city. In the end, Natalya became not only our tour guide but part of our family."
  },
  {
    "name": "CarolynKong",
    "place": "Whitehouse Station, New Jersey",
    "date": "September 3, 2011",
    "title": "Unbelievable experience with Fantastic Guide Natalya!",
    "text": "We had an unbelievable experience with Natalya this summer in St Petersburg. My mother who is 82 yo has always wanted to visit this city. Natalya arranged a wonderful 5 day trip for us - my mother, my teenage daughter and myself. She gave us a warm welcome at the airport, showed us around the city, and then took us to all the wonderful sites in the city as well as in the countryside. She also took us to the farmers market and the metro. When we were thinking of seeing some concerts and the ballet, Natalya went out of her way to help us get tickets as well as arranged a taxi to pick us up after the show. Her attention to detail was greatly appreciated. We really appreciated her vast knowledge of all the art history, political history and also she was great in giving us a personal perspective on life before and after the breakup of the Soviet Union. In summary, I would highly recommend Natalya for anyone planning to visit St Petersburg. She is the best and really made our trip a truly memorable experience that we will cherish for years! Thank you Natalya!!"
  },
  {
    "name": "JimLoomis3",
    "place": "Ha'iku, Maui",
    "date": "August 5, 2011",
    "title": "Natalya made all the difference.",
    "text": "I had just two non-travel days to see St. Petersburg and the smartest thing I ever did was spend that time with Natalya German-Tsarkova as my guide. I not only saw St. Petersburg, I actually came away with a real understanding of this extraordinary city and a profound admiration of the larger-than-life people who built it and rebuilt over almost 300 years. I could never have managed that on my own or by being herded around with a bus full of people. Natalyas English is flawless, shes a bone fide art scholar, and she has an in depth knowledge of Russian history in general and of the history of St. Petersburg in particular. Based on my personal experience, I enthusiastically give both St. Petersburg and Natalya five big glittering gold stars."
  },
  {
    "name": "2Finediners",
    "place": "Andover, Minnesota",
    "date": "July 11, 2011",
    "title": "Wonderful Visit",
    "text": "Natalya made our St. Petersburg trip extremely pleasurable, comfortable, and informative. She was prompt in meeting us each day. Her English was proficient so we had no trouble understanding anything she said to us. Her driving ability and knowledge of streets was excellent, which helped us arrive at places efficiently and in a timely manner. Because of her skills and knowledge, she was able to gain our admittance to attractions with no or very little wait time. We saw everything wed hoped to and more. Her knowledge of art, art history, historical facts and her ability to share it with us was impeccable. She was easy going and easy to talk with making us feel comfortable asking questions and engaging in dialog with her. Her prices were competitive. Group tours offered by our cruise company were about the same price, however they were with a large group, for shorter amounts of time, and a more limited itinerary. We feel we got a better value for our money by booking our tour with Natalya. We met her as a guide, but left friends. We would engage her again and recommend her highly to others."
  },
  {
    "name": "dandj03",
    "place": "Texas",
    "date": "July 6, 2011",
    "title": "Spectacular!",
    "text": "Natalya exceeded even our very high expectations! We do not generally use guides when we travel, but our trip would not have been nearly as successful or fun without Natalya. She helped us from beginning to end-from working with us to craft an itinerary that would fit our interests without missing the must-see sights and some lesser know ones, to giving us four terrific days seeing the city with someone whose depth of knowledge and love of her work was apparent at every turn, to making sure we were delivered to the right airport when it was time to leave! She suggested and then booked for us several terrific restaurants as well as the Marinsky ballet. And Natalya has many ways to make sure you never wait in long lines. She was great at giving us a feel for daily life in St. Petersburg and an interesting simpatico person to spend time with!"
  },
  {
    "name": "Lynne039",
    "place": "Morgan Hill, California",
    "date": "July 6, 2011",
    "title": "MADE OUR TRIP",
    "text": "I recently visited St Petersburg with my granddaughter, 17, and grandson, 15. We are not easy tourists to entertain - Natalya completely charmed us! We left St Petersburg feeling that we had just experienced a special, knowledgeable guide and friend in a beautiful city with many memorable sites.\nYou can always depend on Natalya to be on time. She met us Monday at the airport and took us to our hotel pointing out many sites on the way. We made plans to meet for the day on Wednesday.\nWednesday we took off for The Hermitage and spent more than four hours there. She used her art history background to explain the different art styles and was able to keep the kids involved. Then we moved on to the Yusupov Palace. When we were a little early for our Palace appointment, she suggested we go down the street to 'The Idiot' - a local restaurant - such a fun suggestion - much better than spending 45 minutes waiting at the Palace. We later returned to the Idiot for two special events - my granddaughter's birthday and our last night in St Petersburg.\nThursday was the birthday day - Natalya was booked for a tour with a business group - about four o'clock she came to our hotel with a gift for my granddaughter and took us on a special 'birthday ' tour. We were dressed for the theatre that night - everything came together - my granddaughter felt like royality - special thanks to Natalya.\nFriday we spent the day at Catherine's Palace and Alexander Palace. We walked around the lake at Catherine's. Natalya had made reservations for lunch on the far side of the lake. This became a very entertaining meal - we had a large group of diners enjoying themselves and Russian singers and musicians - everyone joined in song, dance and laughs.\nSunday Natalya came to our hotel for our return trip to the hotel - calling on the way to tell us her arrival time.\nI can not praise Natalya contributions to our trip enough - she had complete respect from the kids - they were eager to please her and truly enjoyed her company. My granddaughter decided she would like to buy a balalaika - mentioned it to Natalya - and in five minutes we were in a traditional old music store - finding a parking space across from the Singer Building even.\nNatalya's knowledge and love for her city shines. For anyone planning a trip to St Petersburg, Natalya makes the trip special."
  },
  {
    "name": "charfst",
    "place": "Madison, Wisconsin",
    "date": "June 24, 2011",
    "title": "Private 3-day tour of St. Petersburg",
    "text": "My husband and I and another couple with whom we travel regularly chose the three-day tour of St. Petersburg with Ms. German. We could not have been more delighted with our visit. Ms. German is an excellent driver. We had three safe and enjoyable days visiting the most significant of St. Petersburg's historic sites and art treasures using her vehicle, which turned out to be a most efficient way to navigate the city. We had looked upon this trip as a oncein-a-lifetime opportunity, aand indeed it was. But we had such a wonderful experience that we would like to go back!\n\nMs. German academic training is in art history, but she also exhibits an in-depth knowledge of the history and culture of the city. Her knowledge of the city, moving along at a pace with which we were comfortable, made the three days particularly enjoyable. We never felt rushed and we were able to slow down to absorb particular places of interest to us.\n\nMs. German's English is fluent. She is easy to be with, very pleasant and considerate of her clients, and she has a knack for finding a way to get her clients into the palaces and museums promptly and without any hassles, despite the crowds. We were amazed at how smoothly our visit went and how much we had seen after the three days were over.\n\n.We recommend Ms. German highly and without reservation. She is, quite siply, excellent. We would tour with her again given the opportunity.and we felt the fee that she charged was a wise investment."
  },
  {
    "name": "DJ_Ides",
    "place": "Kaunas, Lithuania",
    "date": "May 5, 2011",
    "title": "Best Guide in St Petersburg!!!",
    "text": "We called Natalya on the day that we arrived in St. Petersburg, being a bit overwhelmed by the vastness of the city and the huge numbers of things to do and places to see. We originally only planned to do a one day tour with Natalya, but (after the first day) extended the tour for an additional two days.\n\nNatalya is extremely knowledgeable... she has direct knowledge of even the most arcane details about this amazing city (and its outskirts). She prepared an amazing itinerary for us and accompanied us all about town, guaranteeing that we see as much of St Petersburg as possible in the time that we had remaining.\n\nWe saw most of the major museums and palaces, and were even able to skip the long queues! Natalia is an art historian, and provided wonderful details and commentary on all of the amazing artwork that we saw on our visit. She has an encyclopedic knowledge of the Hermitage, and was able to efficiently navigate us through its vast spaces and corridors to see exactly what we wanted to focus on (and many highlights we would have otherwise missed).\n\nShe also provided completely awesome recommendations for restaurants, steering us clear of any 'tourist traps', and making reservations for us at some truly world class restaurants (that were already fully booked).\n\nMost importantly, Natalya is an all around nice person, and was extremely fun to hang out with during our trip. I should also add that she speaks perfect English. Plus she takes really good photos!\n\nAll in all, Natalya is a world class guide to this beautiful city, and should be the first person that you call once you decide to visit St. Petersburg! We will certainly be calling her again the next time we are in Petersburg!"
  },
  {
    "name": "ovrkil9",
    "place": "Hockessin, Delaware",
    "date": "March 21, 2011",
    "title": "Natalya was the perfect guide for our perfect vacation in a beautiful city!",
    "text": "We spent five days in St. Petersburg for our 20th anniversary. Natalya was our exclusive guide each and every day from arrival to departure. Her English is outstanding and was more than happy to help us with our attempt at speaking Russian. She was prompt and courteous every single minute of every single day, it would not have been possible to spend our week with a better guide. Her knowledge of the country's history, politics and art kept us completely involved each and every day.\nWe visited The Mariinsky Theatre, Natayla purchased our tickets for us in advance directly from the box office, Pavlovsk Palace, Yusupov Palace, Catherine's Palace, The Cottage Palace, Peterhoff Palace, The Hermitage Musuem, Peter I Park, and The Siege of Leningrad Memorial (a must see).\nWe enjoyed the most wonderful meal ever at The Noble Nest followed by a private boat tour at midnight on the Neva River. Complete with candle light and champagne. (This evening was a complete surprise. We simply asked Natalya to plan the most memorable evening possible for our anniversary. And she did!)\nWe also dined at Podvorye, Teplo and several of Natalya's local favorite's.\nFinally, we stayed at The Angleterre Hotel accross from St. Isaac's Cathedral. A great location that is within walking distance of The Hermitage, Catherine's Palace and the ferry to The Peter & Paul Fortress.\nBring comfortable walking shoes for all the palaces and for strolling around the streets of St. Petersburg. The evenings were a bit cool, bring something light to add to your day wear."
  },
  {
    "name": "jtdsalem",
    "place": "Columbia, South Carolina",
    "date": "March 19, 2011",
    "title": "The Most Engaging Guide We've Ever Had!",
    "text": "While my wife and I were in St. Petersburg, Russia on a Viking cruise, we asked Natalya German-Tsarkova to provide us with three days of excursions. She had been recommended by an American friend living in the city. She was fabulous! Sha has a major in Art History and her command of the English language is so powerful you almost have to watch your own grammar.\nOur comments to her after returning to the U.S. are as follows:\n'Counting the latest boat trip, your tour would be the third time we have visited the Hermitage. The first two (sponsored by the cruise lines) were a joke, so random, and we were so frustrated. You gave us the proper perspective for understanding the Hermitage and its treasures! We both felt you were family after three days...we've had other guides, but the ones that stand out are those who are very interested in their subject and sensitive to the interests of the people they are touring. You were all of the above, and without question, our three days in St. Petersburg under your guidance and with your knowledge of art history were the highlight of our trip to Russia!'\nWe have since recommended Natalya to others.\nA delightful response to us from a couple going to Russia for a wedding reflects just how important Natalya was to their trip...'we just got home a few hours ago, but I had to write you and say thanks for telling us about Natalya. She was just great, very informative, sweet, helpful and wonderful!"
  },
  {
    "name": "janeanddick",
    "place": "Salem, Oregon",
    "date": "February 27, 2011",
    "title": "Natalya is a knowledgable, resourceful and insightful Guide.",
    "text": "In Sept. 2009 we had an excellent tour of St. Petersburg with Natalya German-Tsarkova. Our two days in St. Petersburg with Natalya were the highlight of our two-week Baltic Sea cruise. She took us on an extensive tour of the palaces and churches on our list and they were spectacular!\nOne of us has walking limitations, and Natalya went above and beyond, accommodating our special needs, driving as close as possible to the sights and arranging for use of our wheelchair where it was possible. She knew exactly where the wheelchair would be an asset and where it would be a liability. We would not have been able to see all of these treasures without her tireless help.\nNatalya was most helpful in developing a tour in advance to meet our specific interests and our desire for photographic opportunities. We feel that we learned so much from her about the art, history and architecture of the city and even more importantly, about the culture and history of the Russian people. She also shared personal and family experiences that gave us insights into Russian life.\nWe enthusiastically recommend Natalya as a guide for anyone who wants to get the most out of their St. Petersburg experience."
  },
  {
    "name": "twin34242",
    "place": "Gainesville, Florida",
    "date": "February 15, 2011",
    "title": "Delightful and informative Guide ! Best in St. Petersburg!!",
    "text": "Natasha was just superb. She was our personal guide for three wonderful days in St. Petersburg. From the very beginning, she was incredibly helpful. She helped with our Visas, accommodations an air transportation. Her ivast knowledge of her country, its history, and art only enhanced our visit. We HIGHLY recommend Natasha for any and all guiding services throughout St. Petersburg. !!"
  },
  {
    "name": "OxfordLady63",
    "place": "Rome",
    "date": "January 21, 2011",
    "title": "Natalya bewitched us all",
    "text": "In 2005 I took a group of adults from Oxford to St Petersburg for a tour focused on the art and architecture there. We stayed at Casa Leto and Natalya was our guide. On arrival two of the mne announced that they were not keen to spend too much time in the galleries and I took a deep breath expecting I would have to provide bridging between them and the other members of the groups.\nNatalya had no such intentions. She simply wowed them with her love of the the art and inspired them to understand and appreciate what they were seeing.\nAs a bonus she took us to visit the Imperial Academy of Arts where she had been a student.\nShe is a beautiful person with a warm and engaging spirit. I would recommend her to anyone visiting St Petersburg because she knows, understands and loves it."
  },
  {
    "name": "kem_moore",
    "place": "Lakeland, Florida",
    "date": "January 17, 2011",
    "title": "Natalya made our tour of St. Petersburg most memorable!",
    "text": "In July of 2008, my sons and I went to St. Petersburg for 5 days. We had signed up for a package with a wonderful boutique hotel, Casa Leto, and Natalya was our guide the entire time. My youngest son was getting an MA in art in London and had also studied Russian in college. He and Natalya really had a lot in common and our tour was wonderful; she even helped him with his language skills. She was very knowledgeable in art history as well as Russian history, and had so much interesting information for every place we visited. There is no way we could have learned as much about Russia and St. Petersburg without a guide, or even figured out how to get English tours at places on our own. She recommended great restaurants and walking tours as well. She has a lovely personality and is a delight to travel with to all of the special sites in the area. My sons and I highly recommend her as a guide."
  },
  {
    "name": "dragon42",
    "place": "Denver, Colorado",
    "date": "November 12, 2010",
    "title": "St. Petersburg-Great Experience With A Great Guide",
    "text": "My first visit to St. Petersburg was in February, 1981 with 14 ninth grade students. Our group leader was a Russian teacher who spoke fluent Russian. We saw all the beautiful historical sights but were limited in our conversations with the people. Soldiers were everywhere. There were very few cars and even fewer gas stations. We saw numerous lines with people waiting to buy shoes, and food. People were dressed in drab colors and there were few smiles as this was a difficult time for Soviet Union.\nFast forward 29 years to May, 2010 and what a change in the city. Our group of 12 was traveling on Grand Circle Cruises and our boat was docked in the port at St. Petersburg where we spent the next 4 days. Our group agreed that our day spent with our private guide, Natalya German-Tsarkova was the best part of our time spent in that fabulous city. Natalya speaks fluent English and I might add that her English is not the British accent type. She actually sounds American and even knows many of our slang phrases.\nNatalya met us at our port about 8:30 a.m. with a van and we spent a wonderful fun packed day with her. One of the highlights was our visit to the private Diamond Room at the Hermitage Museum plus we spent time in the Impressionists Rooms. Our group had been to the Hermitage 2 days earlier with a Grand Circle tour but we were limited in our time there.\nWe spent part of the morning touring the city and stopping for photo shoots and had lunch at a wonderful restaurant. After lunch we visited the Yusupov Palace which is famous as the place where Rasputin was murdered. We finished our day with a boat ride through the canals of the city. Our tour concluded around 6 p.m. Some of our group stayed in the city to attend the ballet and Natalya arranged for her husband to meet those people and drive them back to the ship.\nI can honestly recommend Natalya as a great guide in the city of St. Petersburg. She is knowledgeable, very honest in her opinions, and very enjoyable to be with. We each paid $200.00 U.S. for our full day (lunch was not included). We all felt it was well worth the price to be with our own group and to be able to converse with our guide and to not feel rushed at every stop we made. Natalya's website is www.original-tours.com.\nSt. Petersburg has made great changes and all for the better. People are happy and smile a lot and the colors are no longer drab but bright and cheerful. They do have lots of cars now and that is a problem as they try to figure out traffic patterns and where to park. Sometimes, they park with part of the car on the sidewalk. All in all, it is a great place to visit with good food, and a fascinating history."
  }
]